#!/usr/bin/env python
# -*- coding: utf-8 -*-


chinese = {
    "info": "显示第 _START_ 至 _END_ 项结果，共 _TOTAL_ 项",
    "infoEmpty": "显示第 0 至 0 项结果，共 0 项",
    "paginate": {
        "first":      "First",
        "last":       "Last",
        "next":       "下一页",
        "previous":   "上一页"
    },
    "emptyTable": "表中数据为空",
    "processing": "处理中..."
}

regions = {
    "data": [
    {
      "id": "00",
      "name": "全国"
    },
    {
      "id": "01",
      "name": "未分区域"
    },
    {
      "id": "11",
      "name": "北京市"
    },
    {
      "id": "12",
      "name": "天津市"
    },
    {
      "id": "13",
      "name": "河北省"
    },
    {
      "id": "14",
      "name": "山西省"
    },
    {
      "id": "15",
      "name": "内蒙古自治区"
    },

    {
      "id": "21",
      "name": "辽宁省"
    },
    {
      "id": "22",
      "name": "吉林省"
    },
    {
      "id": "23",
      "name": "黑龙江省"
    },
    {
      "id": "31",
      "name": "上海市"
    },
    {
      "id": "32",
      "name": "江苏省"
    },
    {
      "id": "33",
      "name": "浙江省"
    },
    {
      "id": "34",
      "name": "安徽省"
    },
    {
      "id": "35",
      "name": "福建省"
    },
    {
      "id": "36",
      "name": "江西省"
    },
    {
      "id": "37",
      "name": "山东省"
    },

    {
      "id": "41",
      "name": "河南省"
    },
    {
      "id": "42",
      "name": "湖北省"
    },
    {
      "id": "43",
      "name": "湖南省"
    },
    {
      "id": "44",
      "name": "广东省"
    },
    {
      "id": "45",
      "name": "广西壮族自治区"
    },
    {
      "id": "46",
      "name": "海南省"
    },

    {
      "id": "50",
      "name": "重庆市"
    },
    {
      "id": "51",
      "name": "四川省"
    },
    {
      "id": "52",
      "name": "贵州省"
    },
    {
      "id": "53",
      "name": "云南省"
    },
    {
      "id": "54",
      "name": "西藏自治区"
    },
    {
      "id": "61",
      "name": "陕西省"
    },
    {
      "id": "62",
      "name": "甘肃省"
    },
    {
      "id": "63",
      "name": "青海省"
    },
    {
      "id": "64",
      "name": "宁夏回族自治区"
    },
    {
      "id": "65",
      "name": "新疆维吾尔自治区"
    }
  ]
}

websites = {
    "data": [
    {
        "id": "000",
        "name": "全部网站"
    },
    {
        "id": "001",
        "name": "中央政府采购网"
    },
    # {
    #     "id": "002",
    #     "name": "中国招标网"
    # },
    # {
    #     "id": "003",
    #     "name": "千里马招标网"
    # },
    # {
    #     "id": "004",
    #     "name": "招标采购导航网"
    # },
    # {
    #     "id": "005",
    #     "name": "中国住建网"
    # },
    # {
    #     "id": "006",
    #     "name": "辽宁省政府采购网-中国采招网"
    # },

    {
        "id": "101",
        "name": "北京市政府采购中心"
    },
    {
        "id": "102",
        "name": "天津市政府采购网"
    },
    # {
    #     "id": "103",
    #     "name": "河北省政府采购网"
    # },
    {
        "id": "104",
        "name": "河北省招标投标综合网"
    },
    {
        "id": "105",
        "name": "中国山西政府采购网"
    },
    # {
    #     "id": "106",
    #     "name": "山西省省级政府采购中心"
    # },
    # {
    #     "id": "107",
    #     "name": "山西招投标网"
    # },
    # {
    #     "id": "108",
    #     "name": "内蒙古自治区"
    # },
    {
        "id": "109",
        "name": "内蒙古自治区政府采购中心"
    },

    {
        "id": "201",
        "name": "辽宁政府采购网"
    },
    {
        "id": "202",
        "name": " 辽宁省政府集中采购网"
    },
    {
        "id": "203",
        "name": "辽宁省政府采购-东北新闻网"
    },
    {
        "id": "204",
        "name": "吉林省政府采购中心"
    },
    # {
    #     "id": "205",
    #     "name": "吉林省公共资源交易信息网"
    # },
    # {
    #     "id": "206",
    #     "name": "吉林市公共资源交易网"
    # },
    {
        "id": "207",
        "name": "黑龙江省政府采购网"
    },

    # {
    #     "id": "301",
    #     "name": "上海政府采购网"
    # },
    {
        "id": "302",
        "name": "江苏政府采购网"
    },
    {
        "id": "303",
        "name": "南京市政府采购网"
    },
    {
        "id": "304",
        "name": "苏州市政府采购网"
    },
    {
        "id": "305",
        "name": "浙江政府采购网"
    },
    {
        "id": "306",
        "name": "安徽省政府采购网"
    },
    # {
    #     "id": "307",
    #     "name": "安徽省招标投标信息网"
    # },
    {
        "id": "308",
        "name": "福建省政府采购网"
    },
    # {
    #     "id": "309",
    #     "name": "福建招标与采购网"
    # },
    {
        "id": "310",
        "name": "江西省公共资源交易网"
    },
    {
        "id": "311",
        "name": "中国山东政府采购网"
    },
    # {
    #     "id": "312",
    #     "name": "山东政府集中采购网"
    # },

    {
        "id": "401",
        "name": "河南省政府采购网"
    },
    {
        "id": "402",
        "name": "湖北省政府采购网"
    },
    {
        "id": "403",
        "name": "湖南省政府采购网"
    },
    # {
    #     "id": "404",
    #     "name": "湖南省公共资源交易中心政府集中采购"
    # },
    {
        "id": "405",
        "name": "广东省政府采购网"
    },
    # {
    #     "id": "406",
    #     "name": "广东省政府采购中心"
    # },
    {
        "id": "407",
        "name": "广西壮族自治区政府采购网"
    },
    {
        "id": "408",
        "name": "中国海南政府采购网"
    },

    {
        "id": "501",
        "name": "重庆市政府采购网"
    },
    # {
    #     "id": "502",
    #     "name": "四川省政府政务服务和公共资源交易服务中心"
    # },

    # {
    #     "id": "503",
    #     "name": "四川招投标网"
    # },
    {
        "id": "504",
        "name": "四川政府采购"
    },
    {
        "id": "505",
        "name": "贵州省政府采购网"
    },
    # {
    #     "id": "506",
    #     "name": "贵州省招标投标网"
    # },
    # {
    #     "id": "507",
    #     "name": "贵州省公共资源交易中心"
    # },
    {
        "id": "508",
        "name": "云南省政府采购网"
    },
    # {
    #     "id": "509",
    #     "name": "云南省公共资源交易中心"
    # },
    {
        "id": "510",
        "name": "西藏自治区政府采购网"
    },

    # {
    #     "id": "511",
    #     "name": "西藏自治区招标投标网"
    # },

    {
        "id": "601",
        "name": "陕西省政府采购"
    },
    {
        "id": "602",
        "name": "甘肃政府采购网"
    },
    {
        "id": "603",
        "name": "青海省政府采购"
    },
    # {
    #     "id": "604",
    #     "name": "宁夏政府采购公共服务平台"
    # },
    # {
    #     "id": "605",
    #     "name": "宁夏回族自治区公共资源交易网"
    # },
    # {
    #     "id": "606",
    #     "name": "新疆维吾尔自治区政府采购网"
    # }
  ]
}